lisp/org-packages.org
** MELPA 换源

#+BEGIN_SRC emacs-lisp
(require 'cl)

(when (>= emacs-major-version 24)
  (add-to-list 'package-archives '("melpa" . "http://mirrors.tuna.tsinghua.edu.cn/elpa/melpa/") t)
  )
#+END_SRC

** 下载插件

#+BEGIN_SRC emacs-lisp
;; add whatever packages you want here
(defvar stone/packages '(
			 company
			 monokai-theme
			 hungry-delete
			 swiper
			 counsel
			 smartparens
			 js2-mode
			 nodejs-repl
			 exec-path-from-shell
			 popwin
			 reveal-in-osx-finder
			 ) "Default packages")

(setq package-selected-packages stone/packages)

(defun stone/packages-installed-p ()
	(loop for pkg in stone/packages
				when (not (package-installed-p pkg)) do (return nil)
				finally (return t)))

(unless (stone/packages-installed-p)
	(message "%s" "Refreshing package database...")
	(package-refresh-contents)
	(dolist (pkg stone/packages)
		(when (not (package-installed-p pkg))
			(package-install pkg))))
#+END_SRC

** hungry-delete

#+BEGIN_SRC emacs-lisp
(global-hungry-delete-mode)
#+END_SRC

** swiper

#+BEGIN_SRC emacs-lisp
(ivy-mode 1)
(setq ivy-use-virtual-buffers t)
(setq enable-recursive-minibuffers t)
#+END_SRC

** smartparens

#+BEGIN_SRC emacs-lisp
(smartparens-global-mode t)
#+END_SRC

** js2-mode

#+BEGIN_SRC emacs-lisp
(setq auto-mode-alist
      (append
       '(("\\.js\\'" . js2-mode))
       auto-mode-alist))
#+END_SRC

** exec-path-from-shell

#+BEGIN_SRC emacs-lisp
(when (memq window-system '(mac ns))
	(exec-path-from-shell-initialize))
#+END_SRC

** popwin

#+BEGIN_SRC emacs-lisp
(require 'popwin)
(popwin-mode t)
#+END_SRC

** company

#+BEGIN_SRC emacs-lisp
(global-company-mode t)
#+END_SRC

** monokai

#+BEGIN_SRC emacs-lisp
(load-theme 'monokai t)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(provide 'init-packages)
#+END_SRC
